* what is database and why does it matter?
* * is a collection of data. structured computerized data which is accessible data with an interface
* what is sql and mysql

* what is the difference between sql and mysql
* * standard query language and database management system
*

In [35]:
from sqlalchemy import create_engine, text
import pandas as pd
import numpy as np

In [36]:
engine = create_engine('mysql+pymysql://root:password@localhost')

In [37]:
def get_query_result(query):
    with engine.connect() as connection:
        if query.strip().lower().startswith(('select', 'show', 'desc', 'describe', 'explain')):
            return pd.read_sql(query, connection)
        else:
            # print(text(query))
            query = text(query)
            result = connection.execute(query)
            # print('query executed successfully')
            # print("Result:", result)
            # print("Rowcount:", result.rowcount)
            return result

# Execute a select query and store the result in a DataFrame
# Commented out since it might not be applicable directly
# df = get_query_result(sql_select)
# print(df)

In [38]:
# Example query to create a database
sql_create_db = """
drop database house;
"""

In [39]:
sql_select = """SELECT * FROM some_table;"""

In [40]:
get_query_result('drop database house;')

In [41]:
get_query_result('create database house;')

In [42]:
res = get_query_result('use house;')
res
# res.engine.cursor.CursorResult

In [43]:
# Example usage
res = get_query_result('USE house;')

In [44]:
get_query_result('select database();')

  database()
0      house

In [45]:
get_query_result("""create table room 
                    (
                        room_size varchar(255),
                        room_type varchar(255),
                        height float
                    )
                """)

In [46]:
get_query_result(""" show tables """)

  Tables_in_house
0            room

In [47]:
get_query_result(""" desc room """).fetchall()

AttributeError: 'DataFrame' object has no attribute 'fetchall'

In [48]:
pd.DataFrame(get_query_result(""" desc room """).fetchall())

AttributeError: 'DataFrame' object has no attribute 'fetchall'

In [49]:
def query_result_show(query):
    res = get_query_result(query)
    print("Result:", res)
    print("Rowcount:", res.rowcount)
    print("Returns Rows:", res.returns_rows)
    if res.returns_rows:
        return pd.DataFrame(res)
    # if isinstance(res, pd.DataFrame):
    #     print('isinstance')
    #     return res
    else:
        return res

In [50]:
query_result_show(""" desc room """)

Result:        Field          Type Null Key Default Extra
0  room_size  varchar(255)  YES        None
1  room_type  varchar(255)  YES        None
2     height         float  YES        None

AttributeError: 'DataFrame' object has no attribute 'rowcount'

In [51]:
# def get_query_result(query):
#     with engine.connect() as connection:
#         if query.strip().lower().startswith(('select', 'show', 'desc', 'describe', 'explain')):
#             return pd.read_sql(query, connection)
#         else:
#             query = text(query)
#             result = connection.execute(query)
#             # print(text(query))
#             print("Result:", result)
#             print("Rowcount:", result.rowcount)
#             print("Returns Rows:", result.returns_rows)
#             return result

In [52]:
def get_query_result(query):
    with engine.connect() as connection:
        trans = connection.begin()
        try:
            if query.strip().lower().startswith(('select', 'show', 'desc', 'describe', 'explain')):
                result = pd.read_sql(query, connection)
                print("Query executed successfully and returned data.")
                return result
            else:
                query = text(query)
                result = connection.execute(query)
                trans.commit()  # Commit the transaction for non-select queries
                print("Query executed successfully")
                print("Rowcount:", result.rowcount)
                print("Returns Rows:", result.returns_rows)
                return result
        except Exception as e:
            trans.rollback()
            print(f"Query execution failed: {str(e)}")
            return None

In [53]:
get_query_result(""" show tables """)

Query executed successfully and returned data.

  Tables_in_house
0            room

In [54]:
get_query_result('USE house;')

Query executed successfully
Rowcount: 0
Returns Rows: False

In [55]:
get_query_result('select database();')

Query executed successfully and returned data.

  database()
0      house

In [56]:
get_query_result('desc room;')

Query executed successfully and returned data.

       Field          Type Null Key Default Extra
0  room_size  varchar(255)  YES        None
1  room_type  varchar(255)  YES        None
2     height         float  YES        None

In [57]:
get_query_result("""
show tables;
""")

Query executed successfully and returned data.

  Tables_in_house
0            room

In [58]:
get_query_result("""
create table cats 
(
    name varchar(255),
    age int
)
""")

Query executed successfully
Rowcount: 0
Returns Rows: False

In [59]:
get_query_result("""show tables;""")

Query executed successfully and returned data.

  Tables_in_house
0            cats
1            room

In [60]:
get_query_result(""" use house """)

Query executed successfully
Rowcount: 0
Returns Rows: False

In [61]:
sql="""insert into cats (name, age)
        values ('tom', 3);
"""

In [62]:
get_query_result("""
insert into `cats` (`name`, `age`)
values ('jerry', 3);
""")

Query executed successfully
Rowcount: 1
Returns Rows: False

In [63]:
get_query_result(""" select * from cats""")

Query executed successfully and returned data.

    name  age
0  jerry    3

In [64]:
get_query_result("""
insert into `cats` (`name`, `age`)
values 
('tom3', 3),
('tom4', 4),
('tom5', 5);
""")

Query executed successfully
Rowcount: 3
Returns Rows: False

In [65]:
get_query_result("""
select * from `cats`;

""")

Query executed successfully and returned data.

    name  age
0  jerry    3
1   tom3    3
2   tom4    4
3   tom5    5

In [66]:
get_query_result("""

create table people(
first_name varchar(50),
last_name varchar(50),
phone varchar(50)
)

""")

Query executed successfully
Rowcount: 0
Returns Rows: False

In [67]:
get_query_result("""

show tables;

""")

Query executed successfully and returned data.

  Tables_in_house
0            cats
1          people
2            room

In [68]:
get_query_result("""

describe people;

""")

Query executed successfully and returned data.

        Field         Type Null Key Default Extra
0  first_name  varchar(50)  YES        None
1   last_name  varchar(50)  YES        None
2       phone  varchar(50)  YES        None

In [69]:
get_query_result("""

insert into people
values 
('John', 'Doe', '1234567890'),
('Jane', 'Doee', '9876543210'),
('Hafiz', 'Ahamed', '9876543210')
;

""")

Query executed successfully
Rowcount: 3
Returns Rows: False

In [70]:
get_query_result("""

select * from people;

""")

Query executed successfully and returned data.

  first_name last_name       phone
0       John       Doe  1234567890
1       Jane      Doee  9876543210
2      Hafiz    Ahamed  9876543210

In [71]:
get_query_result("""

select * from people;

""")

Query executed successfully and returned data.

  first_name last_name       phone
0       John       Doe  1234567890
1       Jane      Doee  9876543210
2      Hafiz    Ahamed  9876543210

In [72]:
get_query_result("""

create table cat2 (
    name varchar(255) not null,
    age int not null
)

""")

Query executed successfully
Rowcount: 0
Returns Rows: False

In [73]:
get_query_result("""

insert into cat2(name, age)
values ('bob')

""")

Query execution failed: (pymysql.err.OperationalError) (1136, "Column count doesn't match value count at row 1")
[SQL:

insert into cat2(name, age)
values ('bob')

]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [74]:
get_query_result("""

select * from cat2

""")

Query executed successfully and returned data.

Empty DataFrame
Columns: [name, age]
Index: []

In [75]:
get_query_result("""

create table cat3
(
name varchar(255),
age int
)

""")

Query executed successfully
Rowcount: 0
Returns Rows: False

In [76]:
get_query_result("""

insert into cat3(name, age) values
('bob',23)

""")

Query executed successfully
Rowcount: 1
Returns Rows: False

In [77]:
get_query_result("""
desc cat2

""")

Query executed successfully and returned data.

  Field          Type Null Key Default Extra
0  name  varchar(255)   NO        None
1   age           int   NO        None

In [78]:
get_query_result("""
show tables

""")

Query executed successfully and returned data.

  Tables_in_house
0            cat2
1            cat3
2            cats
3          people
4            room

In [79]:
get_query_result("""
create table cat4(
name varchar(255) null 
)

""")

Query executed successfully
Rowcount: 0
Returns Rows: False

In [80]:
get_query_result("""
insert into cat4(name)
values ('')

""")

Query executed successfully
Rowcount: 1
Returns Rows: False

In [81]:
get_query_result("""
insert into cat4(name)
values (null)

""")

Query executed successfully
Rowcount: 1
Returns Rows: False

In [82]:
get_query_result("""
select * from cat4
""")

Query executed successfully and returned data.

   name
0
1  None

In [83]:
get_query_result("""
create table cat5(
name varchar(25) null default 'mew'
)

""")

Query executed successfully
Rowcount: 0
Returns Rows: False

In [84]:
get_query_result("""
insert into cat5(name)
values 
(null)

""")

Query executed successfully
Rowcount: 1
Returns Rows: False

In [85]:
get_query_result("""
select * from cat5

""")

Query executed successfully and returned data.

   name
0  None

In [86]:
get_query_result("""
insert into cat5()
values()

""")

Query executed successfully
Rowcount: 1
Returns Rows: False

In [87]:
get_query_result("""
select * from cat5

""")

Query executed successfully and returned data.

   name
0  None
1   mew

In [88]:
get_query_result("""
desc cat5

""")

Query executed successfully and returned data.

  Field         Type Null Key Default Extra
0  name  varchar(25)  YES         mew

In [89]:
get_query_result("""
create table cat6(
name varchar(100) not null default 'cat6 table cat_name',
age int not null  default 2
)

""")

Query executed successfully
Rowcount: 0
Returns Rows: False

In [90]:
get_query_result("""
desc cat6

""")

Query executed successfully and returned data.

  Field          Type Null Key              Default Extra
0  name  varchar(100)   NO      cat6 table cat_name
1   age           int   NO                        2

In [91]:
get_query_result("""
create table cat8(
id int not null primary key,
name varchar(100) not null default 'cat6 table cat_name',
age int not null  default 2
)

""")

Query executed successfully
Rowcount: 0
Returns Rows: False

In [92]:
get_query_result("""
desc cat8
""")

Query executed successfully and returned data.

  Field          Type Null  Key              Default Extra
0    id           int   NO  PRI                 None
1  name  varchar(100)   NO       cat6 table cat_name
2   age           int   NO                         2

In [93]:
get_query_result("""
insert into cat8(id,name,age)
values 
(2,'cat2',3)


""")

Query executed successfully
Rowcount: 1
Returns Rows: False

In [94]:
get_query_result("""
select * from cat8


""")

Query executed successfully and returned data.

   id  name  age
0   2  cat2    3

In [95]:
get_query_result("""
create table cat9(
id int not null primary key auto_increment,
name varchar(100) not null default 'cat6 table cat_name',
age int not null  default 2
)
""")

Query executed successfully
Rowcount: 0
Returns Rows: False